Repository: frechilla/blockem
Catalog: po/*.po
Languages: es

source: _Game
es: _Juego

source: _View
es: _Ver

source: Show rest of players' pieces
es: Mostrar pieces del _resto de jugadores

source: _Settings
es: _Preferencias

source: _Forbidden areas
es: Áreas _prohibidas

source: Do _not show forbidden area
es: _No mostrar áreas prohibidas

source: Show Mr _Green's forbidden area
es: Mostrar área prohibida del Sr _Verde

source: Show Mr _Blue's forbidden area
es: Mostrar área prohibida del Sr A_zul

source: Show Mr _Yellow's forbidden area
es: Mostrar área prohibida del Sr A_marillo

source: Show Mr _Red's forbidden area
es: Mostrar área prohibida del Sr _Rojo

source: _Influence areas
es: Areas de _Influencia

source: Do _not show influence area
es: _No mostrar áreas de influencia

source: Show Mr _Green's influence area
es: Mostrar área de influencia del Sr _Verde

source: Show Mr _Blue's influence area
es: Mostrar área de influencia del Sr A_zul

source: Show Mr _Yellow's influence area
es: Mostrar área de influencia del Sr A_marillo

source: Show Mr _Red's influence area
es: Mostrar área de influencia del Sr _Rojo

source: Show _nucleation points
es: Mostrar _esquinas válidas

source: _Help
es: _Ayuda

source: About Block'em
es: Acerca de Block'em

source: A board strategy game against the computer
es: Un juego de tablero de estrategia contra el ordenador

source: blockem is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 3 of the License, or (at your option) any later version. blockem is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with blockem; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA
es: blockem es software libre: usted puede redistribuirlo y/o modificarlo bajo los términos de la Licencia Pública General GNU publicada por la Fundación para el Software Libre, ya sea la versión 3 de la Licencia, o (a su elección) cualquier versión posterior. blockem se distribuye con la esperanza de que sea útil, pero SIN GARANTÍA ALGUNA; ni siquiera la garantía implícita MERCANTIL o de APTITUD PARA UN PROPÓSITO DETERMINADO. Consulte los detalles de la Licencia Pública General GNU para obtener una información más detallada. Debería haber recibido una copia de la Licencia Pública General GNU junto a este programa. En caso contrario, consulte <http://www.gnu.org/licenses/>.

source: Configure 1vs1 game
es: Configurar juego de 1 contra 1

source: Type:
es: Tipo:

source: Starting row:
es: Fila inicial:

source: column:
es: columna:

source: AI type:
es: Tipo de IA:

source: Depth:
es: Profundidad:

source: Artificial Intelligence
es: Inteligencia Artificial

source: Green
es: Verde

source: Blue
es: Azul

source: New Game
es: Juego nuevo

source: Number of rows:
es: Número de filas:

source: columns:
es: columnas:

source: Board size
es: Tamaño del tablero

source: Start from anywhere
es: Empezar desde cualquier lugar

source: Starting position
es: Posición inicial

source: Pick a built-in challenge
es: Seleccionar un reto incorporado

source: Load a challenge from a .xml file
es: Cargar un reto desde un archivo .xml

source: Select A Blockem Challenge .xml File
es: Selecciona un archivo .xml de reto blockem

source: Author:
es: Autor:

source: Description:
es: Descripción:

source: Number of rows:
es: Número de filas:

source: columns:
es: columnas:

source: Taken squares:
es: Posiciones ocupadas:

source: challenger's:
es: del aspirante:

source: Challenge's info
es: Datos del aspirante

source: Yellow
es: Amarillo

source: Red
es: Rojo

source: 1 vs 1 Game (2 players)
es: 1 contra 1 (2 jugadores)

source: Total deployment (solo play)
es: Despliegue total (1 jugador)

source: Challenge (solo play)
es: Reto (1 jugador)

source: 4 players game
es: Partida de 4 jugadores

source: Human
es: Humano

source: Computer
es: PC

source: XML Files
es: Archivos XML

source: All Files
es: Todos los archivos

source: <b>Fatal Error:</b> Could not communicate with worker thread. Application will exit now!
es: <b>Error Fatal:</b> No se pudo comunicar con el hilo de procesamiento. La aplicación se cerrará cuando acepte este mensaje

source: Internal Error: Move could not be processed. Please click on the board normally to try again
es: Error interno: El movimiento no se pudo procesar. Por favor haga clic en el tablero de forma normal para intentarlo otra vez

source: Main Window could not be retrieved from a child GUI element
es: No se pudo acceder a la ventana principal desde un elemento hijo de la interfaz

source: That was a <b>DRAW</b>! Both <span color="#%02X%02X%02X">%s</span> and <span color="#%02X%02X%02X">%s</span> have <b>%d</b> squares left
es: Resultado final: ¡<b>EMPATE</b>! A ambos jugadores, <span color="#%02X%02X%02X">%s</span> y <span color="#%02X%02X%02X">%s</span>, les quedan <b>%d</b> cuadrados

source: <b><span color="#%02X%02X%02X">%s</span></b> won! <span color="#%02X%02X%02X">%s</span> has <b>%d</b> squares left and <span color="#%02X%02X%02X">%s</span> has <b>%d</b>
es: ¡<b><span color="#%02X%02X%02X">%s</span></b> ha ganado! A <span color="#%02X%02X%02X">%s</span> le quedaron <b>%d</b> cuadrados y a <span color="#%02X%02X%02X">%s</span> <b>%d</b>

source: <b><span color="#%02X%02X%02X">%s</span></b> won!
es: ¡Ha ganado <b><span color="#%02X%02X%02X">%s</span><b>!

source: It ended in a <b>draw</b>! Two or more player's score is %d
es: La partida acabó en ¡<b>empate</b>! El resultado de dos o más jugadores es %d

source: Final score: <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d
es: Resultado final: <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d | <b><span color="#%02X%02X%02X">%s</span></b> %d

source: Done! You managed to allocate all your pieces
es: ¡Conseguido! Todas tus piezas están puestas en el tablero

source: You can't put down more pieces, but you still have the baby piece left
es: No puedes poner más piezas, pero todavía te queda la pieza de 1 cuadrado

source: Error loading a GUI object from GtkBuilder definitions
es: No se pudo cargar un objeto del GUI de las definiciones de GtkBuilder

source: Error creating processing thread
es: Error en la creación del hilo de procesamiento

source: GUI Exception happened
es: Ha ocurrido una excepción de tipo GUI

source: The game is computing the next move. Are you sure do you want to close the application?
es: El motor de cálculo está procesando el siguiente movimiento. ¿Está seguro de que quiere salir de la aplicación?

source: WARNING: Exception occurred when setting the 16x16 icon into the Main Window from
es: AVISO: Ocurrió una excepción mientras se cargaba el icono de 16x16 píxeles en la ventana principal desde

source: A challenge game can't start without a valid blockem challenge file
es: Un juego de reto no puede comenzar sin un archivo de reto blockem válido

source: Previous move had to be cancelled before applying new settings
es: El procesamiento del movimiento anterior ha tenido que ser cancelado antes de aplicar la nueva configuración

source: <span color="#%02X%02X%02X">%s</span>: %2d left
es: <span color="#%02X%02X%02X">%s</span>: queda %2d

source: Rotate
es: Rotar

source: M i r r o r
es: E s p e j o

source: Challenge .xml file doesn't exist: %s
es: El archivo .xml de desafío no existe: %s

source: XML syntax error
es: Error the sintaxis XML

source: Root element does not exist or is not called "blockem_challenge"
es: El elemento XML raíz no existe o no se llama "blockem_challenge"

source: Root element does not have mandatory property "name"
es: El elemento XML raíz no contiene la propiedad obligatoria "name"

source: Root element's property "name" can't be empty
es: La propiedad "name" del elemento XML raíz no puede estar vacía

source: Mandatory elements missing:
es: Elementos obligatorios no están presentes:

source: Following coords are taken by both challenger and opponent:
es: La coordenadas siguientes están ocupadas por el aspirante y el oponente

source: Challenger's starting coordinate is taken by the opponent
es: La coordenada inicial del aspirante está ocupada por el oponente

source: Challenger's starting coordinate is taken by the challenger
es: La coordenada inicial del aspirante está ocupada por el propio aspirante

source: Bad integer value in "nrows"
es: Entero incorrecto en "nrows"

source: Bad integer value in "nrows". MUST be a positive number
es: Entero incorrecto en "nrows". DEBE ser un número positivo

source: Bad integer value in "ncolumns"
es: Entero incorrecto en "ncolumns"

source: Bad integer value in "ncolumns". MUST be a positive number
es: Entero incorrecto en "ncolumns". DEBE ser un número positivo

source: Mandatory elements in "board" missing:
es: Elementos obligatorios en "board" no están presentes:

source: "opponent" -> "taken" mandatory attribute "row" is missing
es: "opponent" -> "taken": Falta atributo obligatorio "row"

source: Bad integer value in opponent's "row" attribute ("taken" tag)
es: Entero incorrecto en el atributo "row" del oponente (tag "taken")

source: Bad integer value in opponent's "row" attribute ("taken" tag). MUST be >= 0
es: Entero incorrecto en el atributo "row" del oponente (tag "taken"). DEBE ser mayor o igual a 0

source: Bad integer value in opponent's "row" attribute ("taken" tag). MUST be lower than the number of rows of the board
es: Entero incorrecto en el atributo "row" del oponente (tag "taken"). DEBE ser menor que el número de filas del tablero

source: "opponent" -> "taken" mandatory attribute "col" is missing
es: "opponent" -> "taken": Falta atributo obligatorio "col"

source: Bad integer value in opponent's "col" attribute ("taken" tag)
es: Entero incorrecto en el atributo "col" del oponente (tag "taken")

source: Bad integer value in opponent's "col" attribute ("taken" tag). MUST be >= 0
es: Entero incorrecto en el atributo "col" del oponente (tag "taken"). DEBE ser mayor o igual a 0

source: Bad integer value in opponent's "col" attribute ("taken" tag). MUST be lower than the number of columns of the board
es: Entero incorrecto en el atributo "col" del oponente (tag "taken"). DEBE ser menor que el número de columnas del tablero

source: "challenger" -> "taken" mandatory attribute "row" is missing
es: "challenger" -> "taken": Falta atributo obligatorio "row"

source: Bad integer value in challenger's "row" attribute ("taken" tag)
es: Entero incorrecto en el atributo "row" del aspirante (tag "taken")

source: Bad integer value in challenger's "row" attribute ("taken" tag). MUST be >= 0
es: Entero incorrecto en el atributo "row" del aspirante (tag "taken"). DEBE ser mayor o igual a 0

source: Bad integer value in challenger's "row" attribute ("taken" tag). MUST be lower than the number of rows of the board
es: Entero incorrecto en el atributo "row" del aspirante (tag "taken"). DEBE ser menor que el número de filas del tablero

source: "challenger" -> "taken" mandatory attribute "col" is missing
es: "challenger" -> "taken": Falta atributo obligatorio "col"

source: Bad integer value in challenger's "col" attribute ("taken" tag)
es: Entero incorrecto en el atributo "col" del aspirante (tag "taken")

source: Bad integer value in challenger's "col" attribute ("taken" tag). MUST be >= 0
es: Entero incorrecto en el atributo "col" del aspirante (tag "taken"). DEBE ser mayor o igual a 0

source: Bad integer value in challenger's "col" attribute ("taken" tag). MUST be lower than the number of columns of the board
es: Entero incorrecto en el atributo "col" del aspirante (tag "taken"). DEBE ser menor que el número de columnas del tablero

source: "challenger" -> "piece" mandatory attribute "available" is missing
es: "challenger" -> "piece": Falta el atributo obligatorio "available"

source: "challenger" -> "piece" mandatory attribute "available" must be set to either "yes" or "no"
es: "challenger" -> "piece": El atributo obligatorio "available" debe tener como valor "yes" o "no"

source: Bad integer value in challenger's "starting_row"
es: Entero incorrecto en el tag "starting_row" del aspirante

source: Bad integer value in challenger's "starting_row". MUST be >= 0
es: Entero incorrecto en el tag "starting_row" del aspirante. DEBE ser mayor o igual a 0

source: Bad integer value in challenger's "starting_row". MUST be lower than the number of rows of the board
es: Entero incorrecto en el tag "starting_row" del aspirante. DEBE ser menor que el número de filas del tablero

source: Bad integer value in challenger's "starting_col"
es: Entero incorrecto en el tag "starting_col" del aspirante

source: Bad integer value in challenger's "starting_col". MUST be >= 0
es: Entero incorrecto en el tag "starting_col" del aspirante. DEBE ser mayor o igual a 0

source: Bad integer value in challenger's "starting_col". MUST be lower than the number of columns of the board
es: Entero incorrecto en el tag "starting_col" del aspirante. DEBE ser menor que el número de columnas del tablero

source: "starting_row" is present in "challenger", but "starting_col" is not
es: "starting_row" está presente en el tag "challenger", pero "starting_col" no

source: "starting_col" is present in "challenger", but "starting_row" is not
es: "starting_col" está presente en el tag "challenger", pero "starting_row" no

source: Starting coordinate hasn't been set and there aren't any taken squares by the challenger either
es: La coordenada de inicio del aspirante no ha sido configurada y tampoco tiene ningún cuadrado del tablero ocupado

source: Fatal error parsing %s: %s
es: Error fatal analizando sintácticamente %s: %s

source: Mr Green
es: Sr Verde

source: Mr Blue
es: Sr Azul

source: Nucleation points
es: Esquinas válidas

source: Minimax function called once
es: La función minimax ha sido llamada una vez

source: Mr Yellow
es: Sr Amarillo

source: Mr Red
es: Sr Rojo

source: Influence Area
es: Área de influencia

source: Uses the influence areas that a user's pieces create on the board to determine the quality of a move
es: Usa las áreas de influencia de las piezas del usuario para determinar la calidad de los movimientos

source: Mr. Eastwood
es: Clint Eastwood

source: Modified version of "Influence Area". When in doubt it will try to block you out
es: Versión modificada de "Áreas de influencia". Cuando hay duda la heurística tratará de bloquearte

source: NK weighted
es: Importancia de esquinas

source: The more Nucleation points the better. NK points are more important in the middle of the board at the beginning
es: Cuantas más esquinas válidas mejor. Al principio de la partida las esquinas creadas en el centro son más importantes

source: Centre focused
es: Fijación por el centro

source: It has a tendency to create nucleation points over the centre of the board
es: Tiene una tendencia a crear esquinas válidas alreadedor del centro del tablero

source: Takes into account only the amount of squares of the deployed pieces
es: Sólo tiene en cuenta la cantidad de cuadrados de las piezas puestas en el tablero

source: Random
es: Aleatorio

source: Random heuristic. Evaluation function returns a random value so any heuristic can be checked against it
es: La función de evaluación devuelve un valor aleatorio, así que cualquier otra heurística puede comprobarse jugando contra esta

source: Baby piece
es: Pieza de 1

source: Two piece
es: Pieza de 2

source: Three piece
es: Pieza alargada de 3

source: Little V
es: V pequeña

source: Full square
es: Cuadrado entero

source: Four long piece
es: Pieza alargada de 4

source: Little L
es: L pequeña

source: Little S
es: S pequeña

source: Little T
es: T pequeña

source: Big long piece
es: La gran pieza alargada

source: Square++
es: Cuadrado++

source: Big V (aka Half square)
es: V grande

source: U piece
es: Pieza U

source: Big L
es: L Grande

source: Y piece
es: Pieza Y

source: Big S
es: S Grande

source: N piece (aka the ultimate)
es: Pieza N

source: Saf piece
es: Pieza de Saf

source: W piece
es: Pieza W

source: Cross piece
es: Cruz

source: Prints current version of the software and exists
es: Imprime la versión actual de la aplicación y finaliza

source: Specifies the mode blockem runs. Valid options are: '0' GUI is shown (Default); '1' one player total-allocation; '2' 1vs1 Game
es: Parámetro que especifica el modo de ejecución de blockem. Las opciones válidas son: '0' para mostrar la GUI (por defecto); '1' modo de 1 jugador; '2' modo de 1 contra 1

source: 1 player total allocation game's board will have N rows. This is a MANDATORY parameter for --mode=1
es: El tablero de juego en modo de "1 jugador" tendrá N filas. Este parámetro es obligatorio en modo 1 (--mode=1)

source: 1 player total allocation game's board will have N columns. This is a MANDATORY parameter for --mode=1
es: El tablero de juego en modo de "1 jugador" tendrá N columnas. Este parámetro es obligatorio en modo 1 (--mode=1)

source: Computer will start to allocate pieces in column X (when running with --mode=1). 1st valid column is 0, so maximum allowed column will be (number_of_columns - 1). This is an optional parameter for --mode=1 but if it is set --starting-row must be set too
es: La aplicación empezará a poner piezas en la columna X (en modo 1). La mínima columna válida es 0, así que la máxima será el número de columnas menos 1. Este parámetro es opcional en modo 1 (--mode=1), pero si esta opción se usa --starting-row debe configurarse también

source: Computer will start to allocate pieces in row Y (when running with --mode=1). 1st valid row is 0, so maximum allowed row will be (number_of_rows - 1). This is an optional parameter for --mode=1 but if it is set --starting-column must be set too
es: La aplicación empezará a poner piezas en la fila Y (en modo 1). La mínima fila válida es 0, así que la máxima será el número de filas menos 1. Este parámetro es opcional en modo 1 (--mode=1), pero si esta opción se usa --starting-column debe configurarse también

source: Sets the maximum depth of search tree to D when 1vs1 Game is selected. This is a MANDATORY parameter for --mode=2
es: Configura la máxima profundidad del árbol de búsquda al valor D cuando se selecciona el modo "1 contra 1". Este parámetro es obligatorio en modo 2

source: Heuristic to be used when mode is set to 1v1 game (--mode=2). Valid options: '0' "Influence Area" (Default); '1' "Mr. Eastwood"; '2' "NK weighted"; '3' "Centre focused"; '4' "Simple"; '5' "Random"
es: Heurística a usar cuando la aplicación corre en modo "1 contra 1" (--mode=2). Las opciones válidas son: '0' "Área de influencia" (por defecto); '1' "Clint Eastwood"; '2' "Importancia de esquinas"; '3' "Fijación por el centro"; '4' "Simple"; '5' "Aleatorio"

source: Paths to 1vs1game files (mode 2). Blockem will calculate next move per each one of them and print out the result in console. Specifying at least 1 file is MANDATORY for --mode=2
es: Rutas a los archivos de juego de 1 contra 1 (modo 2). Blockem calculará el siguiente movimiento para cada uno de estos archivos e imprimirá los resultados en consola. Debe especificar al menos un archivo cuando use la opción --mode 2

source: [FILE(S)]
es: [ARCHIVO(S)]

source: : Fatal error
es: : Error fatal

source: Try
es: Escriba

source: - The GNU polyominoes board game
es: - El juego de tablero sobre poliominoes GNU

source: Error parsing command line
es: Error analizando las opciones de línea de comando

source: Could not load Gtkbuilder definitions
es: No se pudieron cargar las definiciones de GtkBuilder

source: Number of rows and number of columns must be specified in mode '1'
es: El número de filas y columnas es obligatorio en modo '1'

source: Number of rows and number of columns must be a greater than 1
es: El número de filas y columnas debe ser mayor o igual a 1

source: Both starting row and column must be set to configure a starting coordinate
es: Para configurar la coordenada inicial debe especificar la fila y la columna

source: Application cannot start outside the board boundaries
es: La aplicación no puede empezar fuera de los límites del tablero

source: SOLVED!
es: ¡RESUELTO!

source: Could not allocate all the pieces in this %dx%d board, starting from row %d, columnd %d
es: No se pudieron colocar todas las piezas en este tablero de %dx%d, empezando en la fila %d y la columna %d

source: Could not allocate all the pieces in this %dx%d board starting from anywhere in the board
es: No se pudieron colocar todas las piezas en este tablero de %dx%d, empezando desde cualquier coordenada del tablero

source: At least one file with a 1vs1Game saved must be specified
es: Debe especificar al menos un archivo de juego 1 contra 1

source: Invalid heuristic type (%d)
es: Tipo de heurística incorrecto (%d)

source: Evaluation function set to %s (%d)
es: Función de evaluación configurada como %s (%d)

source: Depth in 1vs1Game mode must be set to a positive value
es: La profundidad para el juego de 1 contra 1 debe ser un número positivo

source: Warning: For better results you might want to set the depth to an odd number
es: Aviso: Para conseguir mejores resultados la profundidad debería de ser un número impar

source: %s: Error: '%s' doesn't exist. Trying next file...
es: %s: Error: '%s' no existe. Intentando con el archivo siguiente...

source: %s: Error: '%s' could not be opened. Trying next file...
es: %s: Error: '%s' no pudo abrirse. Intentando con el archivo siguiente...

source: %s: Error: '%s' does not contain a valid 1vs1Game. Trying next file...
es: %s: Error: '%s' no contiene un juego 1 contra 1 válido. Intentando con el archivo siguiente...

source: Game succesfully loaded from '%s'
es: Juego cargado correctamente de '%s'

source: Winning evaluation function value: %d
es: Valor de la función de evaluación ganadora: %d

source: =================================================== === END OF THE GAME. NO PIECE COULD BE PUT DOWN === ===================================================
es: ========================================================= === FINAL DEL JUEGO. NO SE PUDO COLOCAR NINGUNA PIEZA === =========================================================

source: Invalid --mode option (%d)
es: Opción --mode inválida (%d)
